src/DataProcessors/ОформлениеПустыхКанбановДляАдминистраторов/ОформлениеПустыхКанбановДляАдминистраторов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОформлениеПустыхКанбановДляАдминистраторов</name>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Канбаны</name>
    <attributes>
      <name>Пометка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоХранения</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>ОформленоЯчеек</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЯчеек</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПустыхЯчеек</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/InformationRegisters/ЯчейкиКомплектации/ЯчейкиКомплектации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЯчейкиКомплектации</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>КоличествоЯчеек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоВЯчейке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТочкаЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГруппаРасчёта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/DataProcessors/ОформлениеПустыхКанбановДляАдминистраторов/Forms/Форма/Module.bsl
&НаСервере
Процедура ПолучитьДанныеНаСервере()
Объект.Канбаны.Очистить();
Запрос = Новый Запрос;
 
Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЯчейкиКомплектацииСрезПоследних.МестоХранения,
	|	ЯчейкиКомплектацииСрезПоследних.МПЗ,
	|	ЯчейкиКомплектацииСрезПоследних.КоличествоЯчеек
	|ИЗ
	|	РегистрСведений.ЯчейкиКомплектации.СрезПоследних(&НаДату, ) КАК ЯчейкиКомплектацииСрезПоследних"; 
Запрос.УстановитьПараметр("НаДату", ТекущаяДата()); 
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ТипЗнч(ВыборкаДетальныеЗаписи.МПЗ) = Тип("СправочникСсылка.Номенклатура") Тогда
		ВыбПодразделение = ВыборкаДетальныеЗаписи.МПЗ.Канбан.Подразделение;
		Иначе
		ВыбПодразделение = Константы.МестоХраненияОсновное.Получить().Подразделение;
		КонецЕсли;
			Если Не Объект.Подразделение.Пустая() Тогда
				Если ВыбПодразделение <> Объект.Подразделение Тогда				
				Продолжить;
				КонецЕсли;			
			КонецЕсли;
				Если ВыбПодразделение.ОформлятьПустыеКанбаны <> 1 Тогда
				Продолжить;		
				КонецЕсли;   
	ТЧ = Объект.Канбаны.Добавить();
	ТЧ.МестоХранения = ВыборкаДетальныеЗаписи.МестоХранения;
	ТЧ.МПЗ = ВыборкаДетальныеЗаписи.МПЗ;	
	ТЧ.КоличествоЯчеек = ВыборкаДетальныеЗаписи.КоличествоЯчеек;
	ТЧ.ОформленоЯчеек = ОбщийМодульВызовСервера.ПолучитьКоличествоПустыхКанбановПоМестуХранения(ВыборкаДетальныеЗаписи.МестоХранения,ВыборкаДетальныеЗаписи.МПЗ);
	КонецЦикла;
		Если СортироватьПо = 1 Тогда
		Объект.Канбаны.Сортировать("МестоХранения,МПЗ");
		Иначе	
		Объект.Канбаны.Сортировать("МПЗ,МестоХранения");
		КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанные(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	ПолучитьДанныеНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОформитьПустыеКанбаныНаСервере()
	Для каждого ТЧ Из Объект.Канбаны Цикл
		Если ТЧ.Пометка Тогда
			Для к = 1 По ТЧ.КоличествоПустыхЯчеек Цикл	
			ОбщийМодульРаботаСРегистрами.ОформитьПустойКанбан(ТЧ.МестоХранения,ТЧ.МПЗ);
			КонецЦикла; 
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОформитьПустыеКанбаны(Команда)
ОформитьПустыеКанбаныНаСервере();
Сообщить("Оформление завершено!"); 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
СортироватьПо = 1;
КонецПроцедуры

&НаКлиенте
Процедура СортироватьПоПриИзменении(Элемент)
	Если СортироватьПо = 1 Тогда
	Объект.Канбаны.Сортировать("МестоХранения,МПЗ");
	Иначе	
	Объект.Канбаны.Сортировать("МПЗ,МестоХранения");
	КонецЕсли; 
КонецПроцедуры
